#pragma once
#include <stdint.h>

enum class Note : uint16_t {
    // --- Чистые ноты (Белые клавиши) ---
    C3 = 130,  D3 = 146,  E3 = 164,  F3 = 174,  G3 = 196,  A3 = 220,  B3 = 246,
    C4 = 262,  D4 = 294,  E4 = 330,  F4 = 349,  G4 = 392,  A4 = 440,  B4 = 494,
    C5 = 523,  D5 = 587,  E5 = 659,  F5 = 698,  G5 = 784,  A5 = 880,  B5 = 988,
    C6 = 1047, D6 = 1175, E6 = 1319, F6 = 1397, G6 = 1568, A6 = 1760, B6 = 1976,
    C7 = 2093, D7 = 2349, E7 = 2637, F7 = 2794, G7 = 3136, A7 = 3520, B7 = 3951,

    // --- Дополнительные частоты (Диезы/Шарпы - Черные клавиши) ---
    Cs3 = 139,  Ds3 = 156,  Fs3 = 185,  Gs3 = 208,  As3 = 233,  // 3-я октава
    Cs4 = 277,  Ds4 = 311,  Fs4 = 370,  Gs4 = 415,  As4 = 466,  // 4-я октава
    Cs5 = 554,  Ds5 = 622,  Fs5 = 740,  Gs5 = 831,  As5 = 932,  // 5-я октава
    Cs6 = 1109, Ds6 = 1245, Fs6 = 1480, Gs6 = 1661, As6 = 1865  // 6-я октава
};